In [1]:
import pandas as pd
import numpy as np

In [2]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0, 10, 4))
ser

0    6
1    3
2    7
3    4
dtype: int64

In [3]:
df = pd.DataFrame(rng.randint(0, 10, (3, 4)),
                 columns=['A', 'B', 'C', 'D'])
df

   A  B  C  D
0  6  9  2  6
1  7  4  3  7
2  7  2  5  4

In [4]:
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [5]:
np.sin(df * np.pi /4)

          A             B         C             D
0 -1.000000  7.071068e-01  1.000000 -1.000000e+00
1 -0.707107  1.224647e-16  0.707107 -7.071068e-01
2 -0.707107  1.000000e+00 -0.707107  1.224647e-16

In [8]:
area = pd.Series({'Alaska':1723337, 'California': 423967, 
                  'Texas': 695662}, name='area')
pop = pd.Series({'California': 38332521, 'Texas':26448193,
                'New York': 19651127}, name='pop')

In [9]:
pop / area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [10]:
area.index | pop.index

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [17]:
A = pd.Series([2, 4, 6], index=[0, 1, 2])
B = pd.Series([1, 3, 5], index=[1, 3, 2])
A + B

0     NaN
1     5.0
2    11.0
3     NaN
dtype: float64

In [18]:
A.add(B, fill_value=0)

0     2.0
1     5.0
2    11.0
3     3.0
dtype: float64

In [19]:
A = pd.DataFrame(rng.randint(0, 20, (2, 2)),
                columns=list('AB'))
A

    A   B
0  19   2
1   4  18

In [20]:
B = pd.DataFrame(rng.randint(0, 10, (3, 3)),
                columns=list('BAC'))
B

   B  A  C
0  6  4  8
1  6  1  3
2  8  1  9

In [21]:
A + B

      A     B   C
0  23.0   8.0 NaN
1   5.0  24.0 NaN
2   NaN   NaN NaN

In [22]:
fill = A.stack().mean()
A.add(B, fill_value=fill)

       A      B      C
0  23.00   8.00  18.75
1   5.00  24.00  13.75
2  11.75  18.75  19.75

In [23]:
A = rng.randint(10, size=(3, 4))
A

array([[8, 9, 4, 1],
       [3, 6, 7, 2],
       [0, 3, 1, 7]])

In [24]:
A - A[0]

array([[ 0,  0,  0,  0],
       [-5, -3,  3,  1],
       [-8, -6, -3,  6]])

In [25]:
df = pd.DataFrame(A, columns=list('QSRT'))
df - df.iloc[0]

   Q  S  R  T
0  0  0  0  0
1 -5 -3  3  1
2 -8 -6 -3  6

In [27]:
df.subtract(df['R'], axis=0)

   Q  S  R  T
0  4  5  0 -3
1 -4 -1  0 -5
2 -1  2  0  6

In [28]:
halfrow = df.iloc[0, ::2]
halfrow

Q    8
R    4
Name: 0, dtype: int64

In [29]:
df - halfrow

     Q    R   S   T
0  0.0  0.0 NaN NaN
1 -5.0  3.0 NaN NaN
2 -8.0 -3.0 NaN NaN